# Create Series

In [4]:
#import pandas
import pandas as pd

In [8]:
#create series
sirs = pd.Series([1,2,3,4])
print(sirs) #it show the full series with index number

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
type(sirs)

pandas.core.series.Series

In [10]:
#Find value ith index number
sirs[2]

3

# Create DatetimeIndex

In [14]:
date = pd.date_range(start = '20-1-2020', end = '7-3-2020')
print(date)

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26', '2020-01-27',
               '2020-01-28', '2020-01-29',
               ...
               '2020-06-24', '2020-06-25', '2020-06-26', '2020-06-27',
               '2020-06-28', '2020-06-29', '2020-06-30', '2020-07-01',
               '2020-07-02', '2020-07-03'],
              dtype='datetime64[ns]', length=166, freq='D')
Length 166

# Create DataFrame

In [94]:
import numpy as np

#create list
temp = np.random.randint(low =15, high = 99, size=[10,])
name = np.random.choice(['Nayem','Taher','Hasina','Kayes'],10)
age = np.random.choice([23,70,57,34],10)

#Cobine three list with zip() function as well as put it in a list
lst = list(zip(temp,name,age))

#create DataFrame
df = pd.DataFrame(data=lst, columns=['temp','name','age']) #Using List
#or
df = pd.DataFrame({'temp':temp, 'name':name, 'age':age}) #Using Dictionary

In [95]:
#Check first five value
df.head()

   temp    name  age
0    95   Nayem   57
1    84   Kayes   34
2    17  Hasina   57
3    40   Taher   57
4    17  Hasina   34

In [96]:
#Check last five value
df.tail()

   temp    name  age
5    72  Hasina   57
6    79   Nayem   23
7    45   Nayem   70
8    27   Kayes   57
9    15   Kayes   57

In [97]:
#Check Columns name
df.columns

Index(['temp', 'name', 'age'], dtype='object')

In [98]:
#Check the series from DataFrame
df.name
#or
df['name']

0     Nayem
1     Kayes
2    Hasina
3     Taher
4    Hasina
5    Hasina
6     Nayem
7     Nayem
8     Kayes
9     Kayes
Name: name, dtype: object

In [99]:
#Check some statistic value of individualcolumn
df['age'].describe()

count    10.000000
mean     50.300000
std      14.659468
min      23.000000
25%      39.750000
50%      57.000000
75%      57.000000
max      70.000000
Name: age, dtype: float64

In [100]:
#If you want to see the DataFrame alike an array
df.values

array([[95, 'Nayem', 57],
       [84, 'Kayes', 34],
       [17, 'Hasina', 57],
       [40, 'Taher', 57],
       [17, 'Hasina', 34],
       [72, 'Hasina', 57],
       [79, 'Nayem', 23],
       [45, 'Nayem', 70],
       [27, 'Kayes', 57],
       [15, 'Kayes', 57]], dtype=object)

In [92]:
#Set Index as an any columns
df.set_index('temp', inplace=True) #To make it permanent use inplace

In [93]:
#sort the DataFrame with index
df.sort_index(axis=0)

        name  age
temp
51     Kayes   70
54     Taher   70
57     Taher   70
57     Kayes   34
61     Nayem   57
65    Hasina   23
66    Hasina   23
79     Nayem   70
86     Nayem   34
90     Kayes   57

In [78]:
#Sort the DataFrame with any column
df.sort_values(by='name', ascending = False)

        name  age
temp
98     Taher   23
94     Taher   34
95     Taher   34
29     Nayem   70
52     Nayem   23
58     Kayes   34
28     Kayes   70
70     Kayes   57
28    Hasina   34
65    Hasina   34

In [83]:
#To drop any column
df.drop(['age'],axis=1) #This drop is temporary

        name
temp
28    Hasina
29     Nayem
98     Taher
58     Kayes
94     Taher
65    Hasina
52     Nayem
95     Taher
28     Kayes
70     Kayes

In [116]:
#Locating any value of DataFrame with iloc
print(df.iloc[0,1]) #[rowNumber,ColumnNumber]
print('-----------')
print(df.iloc[0:5,1]) #[rowNumber Range, ColumnNumber]
print('-----------')
print(df.iloc[0:5, 0:2]) #[rowNumber Range, ColumbNumber range]
print(df.iloc[[True,True,False,True,False,True,False,False,True,False]]) #False mean Not locate, Ture mean locatable

Nayem
-----------
0     Nayem
1     Kayes
2    Hasina
3     Taher
4    Hasina
Name: name, dtype: object
-----------
   temp    name
0    95   Nayem
1    84   Kayes
2    17  Hasina
3    40   Taher
4    17  Hasina
   temp    name  age
0    95   Nayem   57
1    84   Kayes   34
3    40   Taher   57
5    72  Hasina   57
8    27   Kayes   57

In [104]:
df

   temp    name  age
0    95   Nayem   57
1    84   Kayes   34
2    17  Hasina   57
3    40   Taher   57
4    17  Hasina   34
5    72  Hasina   57
6    79   Nayem   23
7    45   Nayem   70
8    27   Kayes   57
9    15   Kayes   57

In [129]:
#Locating any value within whole Data using loc
print(df.loc[2,:]) #[index number,]
print('\n')
print(df.loc[[2,3,4,5]]) #[[indexing multiple row]]
print('\n')
print(df.loc[[True,True,False,True,False,True,False,False,True,False]]) #[[indexing with boolean alike of iloc]]

temp        17
name    Hasina
age         57
Name: 2, dtype: object


   temp    name  age
2    17  Hasina   57
3    40   Taher   57
4    17  Hasina   34
5    72  Hasina   57


   temp    name  age
0    95   Nayem   57
1    84   Kayes   34
3    40   Taher   57
5    72  Hasina   57
8    27   Kayes   57

In [133]:
#locate custom row using index
print(df.loc[[8,9],'name':'age'])

    name  age
8  Kayes   57
9  Kayes   57

In [146]:
#locating the value with condition
print(df.loc[df.age > 50])
print('\n')
print(df.loc[(df.temp > 30) & (df.age > 60)])

   temp    name  age
0    95   Nayem   57
2    17  Hasina   57
3    40   Taher   57
5    72  Hasina   57
7    45   Nayem   70
8    27   Kayes   57
9    15   Kayes   57


   temp   name  age
7    45  Nayem   70

# Read CSV and Excel file from directory

In [149]:
#Read CSV file
df1 = pd.read_csv('weather_data.csv')

#Read Excel file
df2 = pd.read_excel('df_xl.xlsx')

# Concatinate or Merge DataFrame

In [167]:
#Concatinate Data
pd.concat([df,df1],axis=1)

   temp    name  age       day  temperature  windspeed  event
0    95   Nayem   57  1/1/2017         32.0        6.0   Rain
1    84   Kayes   34  1/2/2017         35.0        7.0  Sunny
2    17  Hasina   57  1/3/2017         28.0        2.0   Snow
3    40   Taher   57  1/4/2017         24.0        7.0   Snow
4    17  Hasina   34  1/5/2017         32.0        4.0   Rain
5    72  Hasina   57  1/6/2017         31.0        2.0  Sunny
6    79   Nayem   23       NaN          NaN        NaN    NaN
7    45   Nayem   70       NaN          NaN        NaN    NaN
8    27   Kayes   57       NaN          NaN        NaN    NaN
9    15   Kayes   57       NaN          NaN        NaN    NaN

In [177]:
data1 = pd.DataFrame({
    'name':['Jack','Kayes','Taher'],
    'height':[5.5,5.4,5.5]
})
data2 = pd.DataFrame({
    'name':['Taher','Kayes'],
    'age':[56,23]
})

In [182]:
pd.merge(data1,data2, on='name',how='outer')

    name  height   age
0   Jack     5.5   NaN
1  Kayes     5.4  23.0
2  Taher     5.5  56.0

# Groupby

In [170]:
#To see all group
df_group = df1.groupby('event')
for event in df_group:
    print(event)

('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain)
('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow)
('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)

In [171]:
#To see indevidual group
df_group.get_group('Rain')

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

# Create a colume with values

In [174]:
df1['hot_temp'] =df1['temperature'].apply(lambda x: x > 30)
df1

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

# Pivot Table

In [184]:
df1.pivot_table(values='temperature',index='event',aggfunc='mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [185]:
df1.pivot_table(columns='temperature')

temperature     24     28    31    32    35
hot_temp     False  False  True  True  True
windspeed        7      2     2     5     7

In [187]:
#There are lot of funtion of pivot table. To know more
help(pd.DataFrame.pivot_table)